/* Localizable String */
sUIName = "网络管理程序";
sUIVersion = "程序版本";
sDriverVersion = "驱动版本: v";
sCopyright = "Copyright 2019.";

// Button
OK ="OK";
CANCEL ="取消";
NO ="不";
YES ="好";
Join="连接";
Profiles="详情";
Profiles_v2="首选网络";
Join_Other="加入其他网络";
Show_Nets="显示网络";
Apply="应用";
Remove="移除";
PIN="PIN码";
PBC="PBC";
Forget="忽略此网络";

//DropDownMenu
State_RfOn="Wi-Fi 开启";
State_RfOff="关闭 Wi-Fi";
State_Scan="USB Wi-Fi: 正在搜索...";
State_Unplug="网卡设备未插入";
State_Disable="请开启网卡";

Info_IfName="接口名称:";
Info_MacAddr="MAC地址:";
Info_IpAddr= "IP地址:";
Info_Router= "路由器:";
Info_Reachable= "网络状态：可连接";
Info_Unreachable= "网络状态：不可连接";
//Info_Security
Info_BSSID= "BSSID:";
Info_Channel= "通道:";
Info_CountryCode= "国家代码:";
Info_RSSI= "RSSI:";
Info_Noise= "noise:";
Info_TxRate= "发送频率:";
Info_PhyMode= "PHY模式:";
Info_McsIndex= "MCS索引:";

Radio_ON ="Wi-Fi 开启";
Radio_OFF ="关闭 Wi-Fi";
Join_Other_Network="加入其他网络...";
Create_Adhoc="创建网络";
WPS_Fun="WPS";
Open_Utility="打开网络偏好设置";
Open_Preference="打开网络首选项…";
Edit_Profiles="编辑首选网络";

//ScanTable View
ScanTable_View_Title="选择您想连接的网络";
ScanTable_View_SubTitle="从列表中选择您想连接的网络，必要的话请输入密码";
Associated="连接中";
SignalStrength="信号强度";
Scanning="正在搜索网络";

// Setting Field View
Join_BroadcastSecAP1="此网络";
Join_BroadcastSecAP2="需要";
Join_BroadcastSecAP3="密码";
Join_HiddenSecAP1="此隐藏网络需要";
Join_HiddenSecAP2="密码";
Join_HiddenOpenAP="输入隐藏网络名称";


// Join Other
Create_Infra_Title="请输入网络名称";
Create_Infra_SubTitle="请输入你想加入的网络名称，必要的话请输入密码";
Create_Adhoc_Title="创建一个机对机网络";
Create_Adhoc_SubTitle="请输入您想创建的机对机网络名称";

//Setting Field
Security_None="无";
Security_OpenWep="Open WEP System";
Security_SharedWep="SHARED KEY WEP";
Security_WpaTkip="WPA-PSK TKIP";
Security_WpaAes="WPA-PSK AES";
Security_Wpa2Tkip="WPA2-PSK TKIP";
Security_Wpa2Aes="WPA2-PSK AES";
Security_WpaTkip1X="WPA-EAP TKIP";
Security_WpaAes1X="WPA-EAP AES";
Security_Wpa2Tkip1X="WPA2-EAP TKIP";
Security_Wpa2Aes1X="WPA2-EAP AES";
Security_WEP1X="802.1X WEP";
Security_WpaNoneTkip="WPA-None TKIP";
Security_WpaNoneAes="WPA-None AES";
Security_MixMode="安全性";

//Profile Security Field
Profile_Wep="WEP";
Profile_Wpa="WPA-PSK";
Profile_Wpa2="WPA2-PSK";
Profile_Wpa1X="WPA-EAP";
Profile_Wpa21X="WPA2-EAP";
Profile_WpaNone="WPA-None";

NetworkName="网络名称:";
Security="安全性:";
Password="密码:";
ShowPassword="显示密码";
ASCII="输入ASCII";
UserName="用户名:";
EAP="802.1x EAP:";
PEAP="自动(PEAP)";
TLS="EAP-TLS";
TTLS="EAP-TTLS";
LEAP="EAP-LEAP";
CA_Cert="CA证书:";
Client_Cert="客户端证书:";
Private_Key="密钥:";
Private_Key_Pwd="密钥密码:";

Choose_Private_Key="选择私钥文件（PEM / DER / PFX）";
Choose_Client_Cert="选择客户证书文件（PEM / DER / PFX）";
Choose_CA_Cert="CA选择证书文件 (PEM/DER/CER)";

Select_KeyChain_Cert_Desc="从钥匙串中选择证书";
Select_File_Cert_Desc="选择证书文件";
Select_KeyChain_Identity_Desc="从钥匙串中选择证书";
Select_KeyChain_Key_Desc="从钥匙链中选择密钥";
Select_File_Key_Desc="选择的密钥文件";

Cert_Expire="证书文件已过期";

Cert_Examine_Title1="网络";
Cert_Examine_Title2="认证...";
Cert_Examine_Info1="在对服务器进行身份验证之前";
Cert_Examine_Info2="，您应该检查服务器的证书以确保它适合于此网络。要查看证书，请单击“显示证书”。";


// Profiles
PreferredNet="首选网络:";
StateTitle="状态";
SSIDTitle="SSID";
SecurityTitle="安全性";

//WPS 
WPS_PIN_Title="您的PIN码是：";
WPS_PBC_Title="PBC将会被执行";
WPS_Second="秒";
WPS_Progress="WPS状态:";
WPS_init_Str = "  初始化状态  ";
WPS_scan_Str = "  正在搜索有效的WPS或AP  ";
WPS_connect_Str = "  连接到有效的WPS或AP  ";
WPS_handshake_Str ="  初始化设置  ";
WPS_exchange_Str ="  正在交换...  ";
WPS_done_Str = "  交换成功  ";
WPS_fail_Str = "  WPS交换失败，请连接其他WPS或AP  ";
WPS_start_Str = "  开始连接 ";
WPS_finish_Str = "     连接完成";
WPS_auto_connect_Str = "自动连接WPS或AP";
WPS_timeout_Str = "     连接超时";
WPS_connection_failed_Str = "连接失败，请稍后再试";

Wps_overlap_Str = "Session Overlap";
Wps_more_pbc_Str = "有多个AP在PBC模式！！";
Wps_retry_Str = "请用PIN码来连接，或稍后再试";

ERROR0 = "错误";
ERROR1 = "请输入密钥";
ERROR2 = "错误的WEP密钥";
ERROR3 = "密码必须是8到63个单字节字母数字字符或64个十六进制数字";
ERROR4 = "请输入十六进制数字（0到9，a到f，A到F）作为密码";
ERROR5 = "ASCII密码长度必须为5-13个字符";
ERROR6 = "网络长度不正确";
ERROR7 = "网络长度必须为10-26个字符";
ERROR8 = "两次密码不同";
ERROR9 = "密码不是ASCII格式";
ERROR10 = "网络密钥不是64HEX（0〜9，a〜f，A〜F）格式！";
ERROR11 = "在此频道上，您无法连接到12,13频道或频段2，频段3的特设网络";
ERROR12 = "无法使用WPA-NONE加入Adhoc！";
ERROR13 = "无法使用WPA-PSK加入Adhoc！";
ERROR14 = "不支持WPA/WPA2";
ERROR15 = "请允许程序访问钥匙链";

WARNING0 = "警告";
WARNING1 = "请输入SSID名称";
WARNING2 = "请输入配置文件名称";
WARNING3 = "SSID长度应超过32个字符";
WARNING4 = "该配置文件已经存在。，你想覆盖它吗？";
WARNING5 = "您确认您要删除您所选的配置文件吗？";

NOTICE0 = "注意";
NOTICE1 = "AP模式错误";
NOTICE2 = "STA模式错误";
NOTICE3 = "QOS输入设置模式值出错";
NOTICE4 = "QOS输入设置模式值出错";
NOTICE5 = "QOS模式下值错误";
NOTICE6 = "RTS阈值无效(0 ～ 2432)";
NOTICE7 = "分片阈值无效(256 ~ 2432)";
NOTICE8 = "请在系统偏好设置中打开网卡";
NOTICE9 = "请将Wlan适配器连接到您的电脑";
NOTICE10 = "密码错误，请重试";
